<template>
  <div class="fta-container">
    <h3>事故树分析介绍</h3>
    <div class="fta-context">
      事件树分析是安全工程中的一个重要分析方法，在系统安全分析中有着广泛的应用。事件树分析通过对各种事故现象、原因、结果事件及其组合的分析，找出预防事故的对策。它的作用是对引起事故的各种因素及其逻辑关系进行较全面的分析，阐明各因素的失误对系统的影响，使作业人员充分认识和掌握预防、控制事故发生的各种要点，以充分吸取教训，防止类似事故再次发生。
    </div>
    <h3>分割线</h3>
    <el-tabs type="border-card">
      <el-tab-pane label="挤压碰撞事故">
        <span>
          （1）加强教育培训；
          （2）起重吊装作业及指挥人员必须持证上岗，作业时应与操作人员密切配合，执行规定的指挥信号，不得违章指挥。操作人员应按照指挥人员的信号进行作业，当信号不清或错误时，操作人员可拒绝执行，不得违章操作；
          （3）现场施工负责人应为起重机作业创造必备的操作条件，提供足够的工作场地，清除或避开起重臂起落及回转半径内的障碍物，以保证机械安全作业；
          （4）操作人员进行起重机回转、变幅、行走或吊钩升降等动作前，应发出音响信号示意；
          （5）起重机作业时，起重臂和重物下方严禁有人停留、工作或通过。重物吊运时，严禁从人的上方通过。严禁用起重机载运人员；
          （6）操纵室远离地面的起重机，在正常指挥发生困难时，地面及作业层（高空）的指挥人员均应采用对讲机等有效的通讯联络方式进行指挥。
        </span>
        <div class="img-container">
          <img
            src="@/assets/images/fta1.png"
            alt="挤压碰撞事故"
          >
        </div>
      </el-tab-pane>
      <el-tab-pane label="吊具（物）坠落事故">
        <span>（1）加强教育培训；
          （2）起重吊装作业及指挥人员必须持证上岗，作业时应与操作人员密切配合，执行规定的指挥信号，不得违章指挥。操作人员应按照指挥人员的信号进行作业，当信号不清或错误时，操作人员可拒绝执行，不得违章操作；
          （3）现场施工负责人应为起重机作业创造必备的操作条件，提供足够的工作场地，清除或避开起重臂起落及回转半径内的障碍物，以保证机械安全作业；
          （4）操作人员进行起重机回转、变幅、行走或吊钩升降等动作前，应发出音响信号示意；
          （5）起重机作业时，起重臂和重物下方严禁有人停留、工作或通过。重物吊运时，严禁从人的上方通过。严禁用起重机载运人员；
          （6）操纵室远离地面的起重机，在正常指挥发生困难时，地面及作业层（高空）的指挥人员均应采用对讲机等有效的通讯联络方式进行指挥。
        </span>
        <div class="img-container">
          <img
            src="@/assets/images/fta2.png"
            alt="吊具（物）坠落事故"
          >
        </div>
      </el-tab-pane>
      <el-tab-pane label="机体倾翻事故">
        <span>（1）加强教育培训；
          （2）起重吊装作业及指挥人员必须持证上岗，作业时应与操作人员密切配合，执行规定的指挥信号，不得违章指挥。操作人员应按照指挥人员的信号进行作业，当信号不清或错误时，操作人员可拒绝执行，不得违章操作；
          （3）现场施工负责人应为起重机作业创造必备的操作条件，提供足够的工作场地，清除或避开起重臂起落及回转半径内的障碍物，以保证机械安全作业；
          （4）操作人员进行起重机回转、变幅、行走或吊钩升降等动作前，应发出音响信号示意；
          （5）起重机作业时，起重臂和重物下方严禁有人停留、工作或通过。重物吊运时，严禁从人的上方通过。严禁用起重机载运人员；
          （6）操纵室远离地面的起重机，在正常指挥发生困难时，地面及作业层（高空）的指挥人员均应采用对讲机等有效的通讯联络方式进行指挥。
        </span>
        <div class="img-container">
          <img
            src="@/assets/images/fta3.png"
            alt="机体倾翻事故"
          >
        </div>
      </el-tab-pane>
      <el-tab-pane label="高处坠落事故">
        <span>（1）加强教育培训；
          （2）起重吊装作业及指挥人员必须持证上岗，作业时应与操作人员密切配合，执行规定的指挥信号，不得违章指挥。操作人员应按照指挥人员的信号进行作业，当信号不清或错误时，操作人员可拒绝执行，不得违章操作；
          （3）现场施工负责人应为起重机作业创造必备的操作条件，提供足够的工作场地，清除或避开起重臂起落及回转半径内的障碍物，以保证机械安全作业；
          （4）操作人员进行起重机回转、变幅、行走或吊钩升降等动作前，应发出音响信号示意；
          （5）起重机作业时，起重臂和重物下方严禁有人停留、工作或通过。重物吊运时，严禁从人的上方通过。严禁用起重机载运人员；
          （6）操纵室远离地面的起重机，在正常指挥发生困难时，地面及作业层（高空）的指挥人员均应采用对讲机等有效的通讯联络方式进行指挥。
        </span>
        <div class="img-container">
          <img
            src="@/assets/images/fta4.png"
            alt="高处坠落事故"
          >
        </div>
      </el-tab-pane>
      <el-tab-pane label="触电事故">
        <span>（1）加强教育培训；
          （2）起重吊装作业及指挥人员必须持证上岗，作业时应与操作人员密切配合，执行规定的指挥信号，不得违章指挥。操作人员应按照指挥人员的信号进行作业，当信号不清或错误时，操作人员可拒绝执行，不得违章操作；
          （3）现场施工负责人应为起重机作业创造必备的操作条件，提供足够的工作场地，清除或避开起重臂起落及回转半径内的障碍物，以保证机械安全作业；
          （4）操作人员进行起重机回转、变幅、行走或吊钩升降等动作前，应发出音响信号示意；
          （5）起重机作业时，起重臂和重物下方严禁有人停留、工作或通过。重物吊运时，严禁从人的上方通过。严禁用起重机载运人员；
          （6）操纵室远离地面的起重机，在正常指挥发生困难时，地面及作业层（高空）的指挥人员均应采用对讲机等有效的通讯联络方式进行指挥。
        </span>
        <div class="img-container">
          <img
            src="@/assets/images/fta5.png"
            alt="触电事故"
          >
        </div>
      </el-tab-pane>
    </el-tabs>
  </div>
</template>
<script>
export default {

}
</script>
<style scoped>
.fta-container {
  font-family: "Times New Roman", Avenir, Helvetica, Arial, sans-serif;
  /* font-family: "Times New Roman", SimSun, Georgia, Serif; 
  SimSun 宋体，NSimSun 新宋体，KaiTi 楷体*/
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  font-size: 15px;
  line-height: 25px;
  /* text-align: center; */
  color: #2c3e50;
  padding: 30px;
}

.img-container {
  text-align: center;
}
.img-container img {
  width: 70%;
  height: 70%;
  /* transform: scale(1.1); */
  /* object-fit: scale-down; */
}
</style>